app/controllers/items_controller.rb

  def create
    Item.create(name: item_params[:name], price: item_params[:price], image: item_params[:image], user_id: current_user.id, description: item_params[:description], hoslink: item_params[:hoslink], hostime: item_params[:hostime], showlist1: item_params[:showlist1], showlistmiddle: item_params[:showlistmiddle], showlistbottom: item_params[:showlistbottom])
---
INSERT INTO "items" ("name", "user_id", "image", "description", "hoslink", "hostime", "showlist1", "showlistmiddle", "showlistbottom", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    # @itemというインスタンス変数を用意する
    @item = Item.find_by(id: params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def destroy
    item = Item.find(params[:id])
    item.delete
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]